"""
Даны матрицы А размером 6х5 и С размером 7х4.
Объединить массивы, сформированные из сумм положительных элементов столбцов матриц А и С.
Суммирование положительных элементов столбцов с получением результата в виде массива осуществить в методе.
"""
A=([[1,-1,2,2,3],
    [-3,4,-10,-22,13],
    [14,15,27,-72,-93],
    [19,-167,20,-299,31],
    [-189,188,-212,234,387],
    [109,-1123,211,-2998,-3986]
    ])
C=([[1,-1,-3,-4],
    [2,3,4,5],
    [-10,-11,-100,-1000],
    [6,7,8,9],
    [-89,90,-56,900],
    [20,21,-90,-123],
    [99,88,77,66]
    ])
def res(st1,str1,st2,str22):
    sum1=[]
    sum2=[]
    for i in range(st1):#len(A[0]) столбцы
        summ=0
        for j in range(str1):#len(A) строки
            if A[j][i]>0:
                summ+=A[j][i]
        sum1.append(summ)
    summ=0
    for i in range(st2):#len(C[0]) столбцы
        summ=0
        for j in range(str22):#len(C) строки
            if C[j][i]>0:
                summ+=C[j][i]
        sum2.append(summ)
    result=sum1+sum2
    print(sum1)
    return result
print(res(len(A[0]),len(A),len(C[0]),len(C)))

        
